Kevincoooool/DAPLink/source/hic_hal/stm32/stm32f103xb/DAP_config.h
    pin_out_init(SWDIO_OUT_PIN_PORT, SWDIO_OUT_PIN_Bit);
    SWDIO_OUT_PIN_PORT->BSRR = SWDIO_OUT_PIN;

    pin_in_init(SWDIO_IN_PIN_PORT, SWDIO_IN_PIN_Bit, 1);

    pin_out_od_init(nRESET_PIN_PORT, nRESET_PIN_Bit);
    nRESET_PIN_PORT->BSRR = nRESET_PIN;

    pin_out_init(CONNECTED_LED_PORT, CONNECTED_LED_PIN_Bit);
    CONNECTED_LED_PORT->BSRR = CONNECTED_LED_PIN;
}

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/
__STATIC_INLINE uint32_t RESET_TARGET(void)
{
    return (0);              // change to '1' when a device reset sequence is implemented
}

///@}


///* Private defines -----------------------------------------------------------*/
//#define JTAG_TCK_Pin GPIO_PIN_10
//#define JTAG_TCK_GPIO_Port GPIOB

//#define JTAG_TMS_Pin GPIO_PIN_9
//#define JTAG_TMS_GPIO_Port GPIOB

//#define JTAG_nRESET_Pin GPIO_PIN_11
//#define JTAG_nRESET_GPIO_Port GPIOB

//#define JTAG_TDI_Pin GPIO_PIN_0
//#define JTAG_TDI_GPIO_Port GPIOA

//#define JTAG_TDO_Pin GPIO_PIN_1
//#define JTAG_TDO_GPIO_Port GPIOA

//#define JTAG_nTRST_Pin GPIO_PIN_11
//#define JTAG_nTRST_GPIO_Port GPIOB

//#define LED_CONNECTED_Pin GPIO_PIN_13
//#define LED_GPIO_Port GPIOC

//// Connected LED                PIN13 of GPIOC

//// Target Running LED           Not available

////**************************************************************************************************
///**
//\defgroup DAP_Config_PortIO_gr CMSIS-DAP Hardware I/O Pin Access
//\ingroup DAP_ConfigIO_gr
//@{

//Standard I/O Pins of the CMSIS-DAP Hardware Debug Port support standard JTAG mode
//and Serial Wire Debug (SWD) mode. In SWD mode only 2 pins are required to implement the debug
//interface of a device. The following I/O Pins are provided:

//JTAG I/O Pin                 | SWD I/O Pin          | CMSIS-DAP Hardware pin mode
//---------------------------- | -------------------- | ---------------------------------------------
//TCK: Test Clock              | SWCLK: Clock         | Output Push/Pull
//TMS: Test Mode Select        | SWDIO: Data I/O      | Output Push/Pull; Input (for receiving data)
//TDI: Test Data Input         |                      | Output Push/Pull
//TDO: Test Data Output        |                      | Input
//nTRST: Test Reset (optional) |                      | Output Open Drain with pull-up resistor
//nRESET: Device Reset         | nRESET: Device Reset | Output Open Drain with pull-up resistor


//DAP Hardware I/O Pin Access Functions
//-------------------------------------
//The various I/O Pins are accessed by functions that implement the Read, Write, Set, or Clear to
//these I/O Pins.

//For the SWDIO I/O Pin there are additional functions that are called in SWD I/O mode only.
//This functions are provided to achieve faster I/O that is possible with some advanced GPIO
//peripherals that can independently write/read a single I/O pin without affecting any other pins
//of the same I/O port. The following SWDIO I/O Pin functions are provided:
// - \ref PIN_SWDIO_OUT_ENABLE to enable the output mode from the DAP hardware.
// - \ref PIN_SWDIO_OUT_DISABLE to enable the input mode to the DAP hardware.
// - \ref PIN_SWDIO_IN to read from the SWDIO I/O pin with utmost possible speed.
// - \ref PIN_SWDIO_OUT to write to the SWDIO I/O pin with utmost possible speed.
//*/

//// Configure DAP I/O pins ------------------------------

////   LPC-Link-II HW uses buffers for debug port pins. Therefore it is not
////   possible to disable outputs SWCLK/TCK, TDI and they are left active.
////   Only SWDIO/TMS output can be disabled but it is also left active.
////   nRESET is configured for open drain mode.

///** Setup JTAG I/O pins: TCK, TMS, TDI, TDO, nTRST, and nRESET.
//Configures the DAP Hardware I/O pins for JTAG mode:
// - TCK, TMS, TDI, nTRST, nRESET to output mode and set to high level.
// - TDO to input mode.
//*/
//__STATIC_INLINE void PORT_JTAG_SETUP(void)
//{
//	GPIO_InitTypeDef GPIO_InitStruct = {0};
//	__HAL_RCC_GPIOB_CLK_ENABLE();
//	__HAL_RCC_GPIOA_CLK_ENABLE();
//	//  HAL_GPIO_WritePin(JTAG_TCK_GPIO_Port, JTAG_TCK_Pin, GPIO_PIN_SET);
//	//  HAL_GPIO_WritePin(JTAG_TMS_GPIO_Port, JTAG_TMS_Pin, GPIO_PIN_SET);
//	//  HAL_GPIO_WritePin(JTAG_TDI_GPIO_Port, JTAG_TDI_Pin, GPIO_PIN_SET);
//	//  HAL_GPIO_WritePin(JTAG_nTRST_GPIO_Port, JTAG_nTRST_Pin, GPIO_PIN_SET);
//	//  HAL_GPIO_WritePin(JTAG_nRESET_GPIO_Port, JTAG_nRESET_Pin, GPIO_PIN_SET);
//	GPIOB->BSRR = JTAG_TCK_Pin | JTAG_TMS_Pin | JTAG_TDI_Pin | JTAG_nTRST_Pin | JTAG_nRESET_Pin;

//	/*Configure GPIO pins : JTAG_TCK_Pin JTAG_TMS_Pin JTAG_TDI_Pin */
//	GPIO_InitStruct.Pin = JTAG_TCK_Pin | JTAG_TMS_Pin | JTAG_TDI_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

//	/*Configure GPIO pins : JTAG_nRESET_Pin JTAG_nTRST_Pin */
//	GPIO_InitStruct.Pin = JTAG_nRESET_Pin | JTAG_nTRST_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
//	GPIO_InitStruct.Pull = GPIO_PULLUP;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

//	/*Configure GPIO pin : JTAG_TDO_Pin */
//	GPIO_InitStruct.Pin = JTAG_TDO_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
//	GPIO_InitStruct.Pin = LED_CONNECTED_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(LED_GPIO_Port, &GPIO_InitStruct);
//}

///** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
//Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
// - SWCLK, SWDIO, nRESET to output mode and set to default high level.
// - TDI, TDO, nTRST to HighZ mode (pins are unused in SWD mode).
//*/
//__STATIC_INLINE void PORT_SWD_SETUP(void)
//{
//	__HAL_RCC_GPIOA_CLK_ENABLE();
//	GPIO_InitTypeDef GPIO_InitStruct = {0};

//	//  HAL_GPIO_WritePin(JTAG_TCK_GPIO_Port, JTAG_TCK_Pin, GPIO_PIN_SET);
//	//  HAL_GPIO_WritePin(JTAG_TMS_GPIO_Port, JTAG_TMS_Pin, GPIO_PIN_SET);
//	//  HAL_GPIO_WritePin(JTAG_nRESET_GPIO_Port, JTAG_nRESET_Pin, GPIO_PIN_SET);
//	GPIOB->BSRR = JTAG_TCK_Pin | JTAG_TMS_Pin | JTAG_nRESET_Pin;

//	GPIO_InitStruct.Pin = JTAG_TMS_Pin | JTAG_TCK_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

//	GPIO_InitStruct.Pin = JTAG_nRESET_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
//	GPIO_InitStruct.Pull = GPIO_PULLUP;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(JTAG_nRESET_GPIO_Port, &GPIO_InitStruct);

//	GPIO_InitStruct.Pin = JTAG_TDI_Pin | JTAG_TDO_Pin | JTAG_nTRST_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

//	GPIO_InitStruct.Pin = LED_CONNECTED_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(LED_GPIO_Port, &GPIO_InitStruct);
//}

///** Disable JTAG/SWD I/O Pins.
//Disables the DAP Hardware I/O pins which configures:
// - TCK/SWCLK, TMS/SWDIO, TDI, TDO, nTRST, nRESET to High-Z mode.
//*/
//__STATIC_INLINE void PORT_OFF(void)
//{
//	GPIO_InitTypeDef GPIO_InitStruct = {0};

//	GPIO_InitStruct.Pin = JTAG_TMS_Pin | JTAG_TCK_Pin | JTAG_TDI_Pin |
//						  JTAG_TDO_Pin | JTAG_nTRST_Pin | JTAG_nRESET_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
//}

