Kevincoooool/DAPLink/source/hic_hal/stm32/stm32f103xb/DAP_config.h
//// SWCLK/TCK I/O pin -------------------------------------

///** SWCLK/TCK I/O pin: Get Input.
//\return Current status of the SWCLK/TCK DAP hardware I/O pin.
//*/
//__STATIC_FORCEINLINE uint32_t PIN_SWCLK_TCK_IN(void)
//{
//	return (uint32_t)(JTAG_TCK_GPIO_Port->ODR & JTAG_TCK_Pin ? 1 : 0);
//}

///** SWCLK/TCK I/O pin: Set Output to High.
//Set the SWCLK/TCK DAP hardware I/O pin to high level.
//*/
//__STATIC_FORCEINLINE void PIN_SWCLK_TCK_SET(void)
//{

//	JTAG_TCK_GPIO_Port->BSRR = JTAG_TCK_Pin;
//}

///** SWCLK/TCK I/O pin: Set Output to Low.
//Set the SWCLK/TCK DAP hardware I/O pin to low level.
//*/
//__STATIC_FORCEINLINE void PIN_SWCLK_TCK_CLR(void)
//{

//	JTAG_TCK_GPIO_Port->BRR = JTAG_TCK_Pin;
//}

//// SWDIO/TMS Pin I/O --------------------------------------

///** SWDIO/TMS I/O pin: Get Input.
//\return Current status of the SWDIO/TMS DAP hardware I/O pin.
//*/
//__STATIC_FORCEINLINE uint32_t PIN_SWDIO_TMS_IN(void)
//{
//	//	return PBin(9) ;
//	return (uint32_t)(JTAG_TMS_GPIO_Port->ODR & JTAG_TMS_Pin ? 1 : 0);
//}

///** SWDIO/TMS I/O pin: Set Output to High.
//Set the SWDIO/TMS DAP hardware I/O pin to high level.
//*/
//__STATIC_FORCEINLINE void PIN_SWDIO_TMS_SET(void)
//{
//	// PBout(9) = 1;
//	JTAG_TMS_GPIO_Port->BSRR = JTAG_TMS_Pin;
//}

///** SWDIO/TMS I/O pin: Set Output to Low.
//Set the SWDIO/TMS DAP hardware I/O pin to low level.
//*/
//__STATIC_FORCEINLINE void PIN_SWDIO_TMS_CLR(void)
//{
//	// PBout(9) = 0;
//	JTAG_TMS_GPIO_Port->BRR = JTAG_TMS_Pin;
//}

///** SWDIO I/O pin: Get Input (used in SWD mode only).
//\return Current status of the SWDIO DAP hardware I/O pin.
//*/
//__STATIC_FORCEINLINE uint32_t PIN_SWDIO_IN(void)
//{
//	//	return PBin(9);
//	return (uint32_t)(JTAG_TMS_GPIO_Port->IDR & JTAG_TMS_Pin ? 1 : 0);
//}

///** SWDIO I/O pin: Set Output (used in SWD mode only).
//\param bit Output value for the SWDIO DAP hardware I/O pin.
//*/
//__STATIC_FORCEINLINE void PIN_SWDIO_OUT(uint32_t bit)
//{
//	/**
//    * Important: Use only one bit (bit0) of param!
//	* Sometimes the func "SWD_TransferFunction" of SW_DP.c will
//	* issue "2" as param instead of "0". Zach Lee
//	*/
//	// PBout(9) = bit;
//	if ((bit & 1U) == 1)
//	{
//		JTAG_TMS_GPIO_Port->BSRR = JTAG_TMS_Pin;
//	}
//	else
//	{
//		JTAG_TMS_GPIO_Port->BRR = JTAG_TMS_Pin;
//	}
//}

///** SWDIO I/O pin: Switch to Output mode (used in SWD mode only).
//Configure the SWDIO DAP hardware I/O pin to output mode. This function is
//called prior \ref PIN_SWDIO_OUT function calls.
//*/
//__STATIC_FORCEINLINE void PIN_SWDIO_OUT_ENABLE(void)
//{
//	//	GPIO_InitTypeDef GPIO_InitStruct = {0};

//	//	GPIO_InitStruct.Pin = JTAG_TMS_Pin;
//	//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//	//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	//	HAL_GPIO_Init(JTAG_TMS_GPIO_Port, &GPIO_InitStruct);

//	GPIOB->CRH &= 0XFFFFFF0F;
//	GPIOB->CRH |= 0X00000030; //设置为输出
//}

///** SWDIO I/O pin: Switch to Input mode (used in SWD mode only).
//Configure the SWDIO DAP hardware I/O pin to input mode. This function is
//called prior \ref PIN_SWDIO_IN function calls.
//*/
//__STATIC_FORCEINLINE void PIN_SWDIO_OUT_DISABLE(void)
//{
//	//	GPIO_InitTypeDef GPIO_InitStruct = {0};

//	//	GPIO_InitStruct.Pin = JTAG_TMS_Pin;
//	//	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//	//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//	//	HAL_GPIO_Init(JTAG_TMS_GPIO_Port, &GPIO_InitStruct);

//	GPIOB->CRH &= 0XFFFFFF0F;
//	GPIOB->CRH |= 0X00000080; //设置成输入
//}

//// TDI Pin I/O ---------------------------------------------

///** TDI I/O pin: Get Input.
//\return Current status of the TDI DAP hardware I/O pin.
//*/
//__STATIC_FORCEINLINE uint32_t PIN_TDI_IN(void)
//{
//	return (uint32_t)(JTAG_TDI_GPIO_Port->ODR & JTAG_TDI_Pin ? 1 : 0);
//}

///** TDI I/O pin: Set Output.
//\param bit Output value for the TDI DAP hardware I/O pin.
//*/
//__STATIC_FORCEINLINE void PIN_TDI_OUT(uint32_t bit)
//{
//	if ((bit & 1U) == 1)
//	{
//		JTAG_TDI_GPIO_Port->BSRR = JTAG_TDI_Pin;
//	}
//	else
//	{
//		JTAG_TDI_GPIO_Port->BRR = JTAG_TDI_Pin;
//	}
//}

//// TDO Pin I/O ---------------------------------------------

///** TDO I/O pin: Get Input.
//\return Current status of the TDO DAP hardware I/O pin.
//*/
//__STATIC_FORCEINLINE uint32_t PIN_TDO_IN(void)
//{
//	return (uint32_t)(JTAG_TDO_GPIO_Port->IDR & JTAG_TDO_Pin ? 1 : 0);
//}

//// nTRST Pin I/O -------------------------------------------

///** nTRST I/O pin: Get Input.
//\return Current status of the nTRST DAP hardware I/O pin.
//*/
//__STATIC_FORCEINLINE uint32_t PIN_nTRST_IN(void)
//{
//	return (0U); // Not available
//}

///** nTRST I/O pin: Set Output.
//\param bit JTAG TRST Test Reset pin status:
//           - 0: issue a JTAG TRST Test Reset.
//           - 1: release JTAG TRST Test Reset.
//*/
//__STATIC_FORCEINLINE void PIN_nTRST_OUT(uint32_t bit)
//{
//	(void)bit;
//	; // Not available
//}

//// nRESET Pin I/O------------------------------------------

///** nRESET I/O pin: Get Input.
//\return Current status of the nRESET DAP hardware I/O pin.
//*/
//__STATIC_FORCEINLINE uint32_t PIN_nRESET_IN(void)
//{
//	return (uint32_t)(JTAG_nRESET_GPIO_Port->ODR & JTAG_nRESET_Pin ? 1 : 0);
//}

///** nRESET I/O pin: Set Output.
//\param bit target device hardware reset pin status:
//           - 0: issue a device hardware reset.
//           - 1: release device hardware reset.
//*/
//__STATIC_FORCEINLINE void PIN_nRESET_OUT(uint32_t bit)
//{
//	GPIO_InitTypeDef GPIO_InitStruct = {0};

//	if ((bit & 1U) == 1)
//	{
//		JTAG_nRESET_GPIO_Port->BSRR = JTAG_nRESET_Pin;

//		GPIO_InitStruct.Pin = JTAG_nRESET_Pin;
//		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//		GPIO_InitStruct.Pull = GPIO_NOPULL;
//		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//		HAL_GPIO_Init(JTAG_nRESET_GPIO_Port, &GPIO_InitStruct);
//	}
//	else
//	{
//		JTAG_nRESET_GPIO_Port->BRR = JTAG_nRESET_Pin;

//		GPIO_InitStruct.Pin = JTAG_nRESET_Pin;
//		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
//		GPIO_InitStruct.Pull = GPIO_PULLUP;
//		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//		HAL_GPIO_Init(JTAG_nRESET_GPIO_Port, &GPIO_InitStruct);

//		swd_init_debug();
//		uint32_t swd_mem_write_data = 0x05FA0000 | 0x4;
//		swd_write_memory(0xE000ED0C, (uint8_t *)&swd_mem_write_data, 4);
//	}
//}

