Kevincoooool/DAPLink/source/hic_hal/stm32/stm32f103xb/DAP_config.h
/////@}

////**************************************************************************************************
///**
//\defgroup DAP_Config_LEDs_gr CMSIS-DAP Hardware Status LEDs
//\ingroup DAP_ConfigIO_gr
//@{

//CMSIS-DAP Hardware may provide LEDs that indicate the status of the CMSIS-DAP Debug Unit.

//It is recommended to provide the following LEDs for status indication:
// - Connect LED: is active when the DAP hardware is connected to a debugger.
// - Running LED: is active when the debugger has put the target device into running state.
//*/

///** Debug Unit: Set status of Connected LED.
//\param bit status of the Connect LED.
//           - 1: Connect LED ON: debugger is connected to CMSIS-DAP Debug Unit.
//           - 0: Connect LED OFF: debugger is not connected to CMSIS-DAP Debug Unit.
//*/
//__STATIC_INLINE void LED_CONNECTED_OUT(uint32_t bit)
//{
//	// GPIO_InitTypeDef GPIO_InitStruct = {0};
//	// GPIO_InitStruct.Pin = LED_CONNECTED_Pin;
//	// GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
//	// GPIO_InitStruct.Pull = GPIO_NOPULL;
//	// GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	// HAL_GPIO_Init(LED_GPIO_Port, &GPIO_InitStruct);
//	if ((bit & 1U) == 1)
//	{
//		LED_GPIO_Port->BRR = LED_CONNECTED_Pin;
//	}
//	else
//	{
//		LED_GPIO_Port->BSRR = LED_CONNECTED_Pin;
//	}
//}

///** Debug Unit: Set status Target Running LED.
//\param bit status of the Target Running LED.
//           - 1: Target Running LED ON: program execution in target started.
//           - 0: Target Running LED OFF: program execution in target stopped.
//*/
//__STATIC_INLINE void LED_RUNNING_OUT(uint32_t bit)
//{
//	if ((bit & 1U) == 1)
//	{
//		LED_GPIO_Port->BRR = LED_CONNECTED_Pin;
//	}
//	else
//	{
//		LED_GPIO_Port->BSRR = LED_CONNECTED_Pin;
//	}
//}

/////@}

////**************************************************************************************************
///**
//\defgroup DAP_Config_Timestamp_gr CMSIS-DAP Timestamp
//\ingroup DAP_ConfigIO_gr
//@{
//Access function for Test Domain Timer.

//The value of the Test Domain Timer in the Debug Unit is returned by the function \ref TIMESTAMP_GET. By
//default, the DWT timer is used.  The frequency of this timer is configured with \ref TIMESTAMP_CLOCK.

//*/

///** Get timestamp of Test Domain Timer.
//\return Current timestamp value.
//*/
//__STATIC_INLINE uint32_t TIMESTAMP_GET(void)
//{
//	return (DWT->CYCCNT);
//}
/////@}

////**************************************************************************************************
///**
//\defgroup DAP_Config_Initialization_gr CMSIS-DAP Initialization
//\ingroup DAP_ConfigIO_gr
//@{

//CMSIS-DAP Hardware I/O and LED Pins are initialized with the function \ref DAP_SETUP.
//*/

///** Setup of the Debug Unit I/O pins and LEDs (called when Debug Unit is initialized).
//This function performs the initialization of the CMSIS-DAP Hardware I/O Pins and the
//Status LEDs. In detail the operation of Hardware I/O and LED pins are enabled and set:
// - I/O clock system enabled.
// - all I/O pins: input buffer enabled, output pins are set to HighZ mode.
// - for nTRST, nRESET a weak pull-up (if available) is enabled.
// - LED output pins are enabled and LEDs are turned off.
//*/
//__STATIC_INLINE void DAP_SETUP(void)
//{
//	__HAL_RCC_GPIOA_CLK_ENABLE();
//	__HAL_RCC_GPIOB_CLK_ENABLE();
//	__HAL_RCC_GPIOC_CLK_ENABLE();
//	PORT_JTAG_SETUP();
//	PORT_SWD_SETUP();
//}

///** Reset Target Device with custom specific I/O pin or command sequence.
//This function allows the optional implementation of a device specific reset sequence.
//It is called when the command \ref DAP_ResetTarget and is for example required
//when a device needs a time-critical unlock sequence that enables the debug port.
//\return 0 = no device specific reset sequence is implemented.\n
//        1 = a device specific reset sequence is implemented.
//*/
//__STATIC_INLINE uint8_t RESET_TARGET(void)
//{
//	return (0U); // change to '1' when a device reset sequence is implemented
//}
#endif /* __DAP_CONFIG_H__ */
